src/test/resources/soap/request/request-encryption-wss4j.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP-ENV:Header>
      <wsse:Security
         xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
         xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
         SOAP-ENV:mustUnderstand="1">
         <wsse:BinarySecurityToken
            EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary"
            ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3"
            wsu:Id="G23dd78f3-62ba-49b1-9b73-9d138e963a21">MIICwTCCAiqgAwIBAgIEq0Rx5DANBgkqhkiG9w0BAQsFADBxMRswGQYDVQQDDBJ3d3cuYmVybmFyZG9tZy5jb20xEzARBgNVBAoMCmJlcm5hcmRvbWcxDTALBgNVBAsMBE5vbmUxDzANBgNVBAcMBkxvbmRvbjEQMA4GA1UECAwHRW5nbGFuZDELMAkGA1UEBhMCVUswIBcNMTYxMTI2MTkxNDQxWhgPMjExNzExMDIxOTE0NDFaMHExGzAZBgNVBAMMEnd3dy5iZXJuYXJkb21nLmNvbTETMBEGA1UECgwKYmVybmFyZG9tZzENMAsGA1UECwwETm9uZTEPMA0GA1UEBwwGTG9uZG9uMRAwDgYDVQQIDAdFbmdsYW5kMQswCQYDVQQGEwJVSzCBnzANBgkqhkiG9w0BAQEFAAOBjQAwgYkCgYEArNpb9igfv8WboW2N6aJPppF+gBw1sDU16zixMj/76AKABOHDBl8jC9tDdIM3tE3LRkuNeH2kqqaAOSgzFoYJrHQT4T/Wz7PP1LjeOZzyCOhkmwidQtJxW35cwcYNIVrsvROpoJtKo5DGqVoFckQ5XDBSDJuDOEMqGRiNCLjl5akCAwEAAaNkMGIwHQYDVR0OBBYEFP7W6oEOdj/D/hVDurwuf2lJxqiPMA8GA1UdEwEB/wQFMAMBAf8wCwYDVR0PBAQDAgG2MCMGA1UdJQQcMBoGCCsGAQUFBwMBBggrBgEFBQcDAgYEVR0lADANBgkqhkiG9w0BAQsFAAOBgQAkM6uQYn64he2wxW/a+PpEsQw7R0NK/ORpG13piQUXItg9QFrsUiqHf+NdIPK4C0mu8CNgtToaR/nM1kGYfhp5BowS2CgZplUyOCdCW+/4S/aAN/l78rIe6NXsu5xzrBmqCxcw9v8a4b09zse7UT3lpj2qJOW4hoFSl8Pr8yuGdw==
         </wsse:BinarySecurityToken>
         <xenc:EncryptedKey xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
            Id="EK-0c360ec9-13cf-4690-8c57-0ffe1ca6f660">
            <xenc:EncryptionMethod
               Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-oaep-mgf1p" />
            <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
               <wsse:SecurityTokenReference>
                  <wsse:Reference
                     URI="#G23dd78f3-62ba-49b1-9b73-9d138e963a21"
                     ValueType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-x509-token-profile-1.0#X509v3" />
               </wsse:SecurityTokenReference>
            </ds:KeyInfo>
            <xenc:CipherData>
               <xenc:CipherValue>QtPRb8muMf32thYr9O2vt1eifxwsBxKkd5Kvbcj5fo5FYqPRSaVC59lBCIJOEInYqNLQfid3bu0WbDDQBPL06qRJUGYgwFyjhsxdrd9pyXwT+HYmXVgzItWUEfyM9uvt9fwGVOqIUgwK1xnQdunyLS/skrax9B0m1ipOnM3qz2w=
               </xenc:CipherValue>
            </xenc:CipherData>
            <xenc:ReferenceList>
               <xenc:DataReference
                  URI="#ED-453b379f-9fbc-485e-b5fe-4a7e8c0000a5" />
            </xenc:ReferenceList>
         </xenc:EncryptedKey>
      </wsse:Security>
   </SOAP-ENV:Header>
   <SOAP-ENV:Body>
      <xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"
         Id="ED-453b379f-9fbc-485e-b5fe-4a7e8c0000a5" Type="http://www.w3.org/2001/04/xmlenc#Content">
         <xenc:EncryptionMethod
            Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" />
         <ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
            <wsse:SecurityTokenReference
               xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
               xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
               wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-soap-message-security-1.1#EncryptedKey">
               <wsse:Reference
                  URI="#EK-0c360ec9-13cf-4690-8c57-0ffe1ca6f660" />
            </wsse:SecurityTokenReference>
         </ds:KeyInfo>
         <xenc:CipherData>
            <xenc:CipherValue>iqIbCjVv0W80nqmv6b5EmxqvnuHvBTA7sj7AhpwgMxCiEjXR8/OjFgCK66AVky08MWdGikQ0xIDO7QP0o2RrGz2YdCZw+OjV3NWfxW8Nw/dZ7TpjrOZn2ewnZG+Zf/ldCm99Sh4X6QiWXaAEL1EwXWvLuEfH/awDZc315YwKqOEUq4XRW1U43AROQNwl0ioT
            </xenc:CipherValue>
         </xenc:CipherData>
      </xenc:EncryptedData>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>